       IDENTIFICATION DIVISION.
       PROGRAM-ID. BANK.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  KUNDE-ID PIC X(10).
       01  FORNAVN PIC X(20).
       01  EFTERNAVN   PIC X(20).
       01  KONTONUMMER PIC X(20).
       01  BALANCE PIC S9(6)V9(2).
       01  VALUTAKODE  PIC X(3).
       PROCEDURE DIVISION.
       MOVE 1234567890 TO KUNDE-ID.
       MOVE "Lars" TO FORNAVN.
       MOVE "Hansen" TO EFTERNAVN.
       MOVE "DK12345678912345" TO KONTONUMMER.
       MOVE 2500.75 TO BALANCE.
       MOVE "DKK" TO VALUTAKODE.
       DISPLAY "Kunde-ID    : " KUNDE-ID
       DISPLAY "Navn        : " FORNAVN EFTERNAVN
       DISPLAY "Kontonummer : " KONTONUMMER
       DISPLAY "Balance     : " BALANCE VALUTAKODE
       STOP RUN.
