       02  REG-NR              PIC X(4).
       02  BANKNAVN            PIC X(30).
       02  BANKADDRESSE        PIC X(50).
       02  TELEFON             PIC X(15).
       02  EMAIL               PIC X(30).
       