       02  KUNDE-ID                PIC X(11).
       02  KUNDE-NAVN              PIC X(20).
       02  KUNDE-FØDSELSDAG        PIC X(10).
       02  KUNDE-ADRESSE           PIC X(30).
       02  KUNDE-LAND              PIC X(2).
       