       IDENTIFICATION DIVISION.
       PROGRAM-ID. BANK.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
           01  KUNDE-01.
               COPY "KUNDER.cpy".
           01  KUNDE-02.
               COPY "KUNDER.cpy".
           01  FULDT-NAVN              PIC X(40).
           01  RENS-FULDT-NAVN         PIC X(40).
           01  IX                      PIC 9(2).
           01  IX2                     PIC 9(2) VALUE 1.
           01  CURRENT-CHAR            PIC X(1).
           01  PREVIOUS-CHAR           PIC X(1) VALUE SPACE.
       PROCEDURE DIVISION.
       MOVE 1234567890 TO KUNDE-ID OF KUNDE-01.
       MOVE "Lars" TO FORNAVN OF KUNDE-01.
       MOVE "Hansen" TO EFTERNAVN OF KUNDE-01.
       MOVE "DK12345678912345" TO KONTONUMMER OF KUNDE-01.
       MOVE 2500.75 TO BALANCE OF KUNDE-01.
       MOVE "DKK" TO VALUTAKODE OF KUNDE-01.
       MOVE BALANCE OF KUNDE-01 TO BALANCE-DISPLAY OF KUNDE-01.

       MOVE 9999999999 TO KUNDE-ID OF KUNDE-02.
       MOVE "Mogens" TO FORNAVN OF KUNDE-02.
       MOVE "Hansen" TO EFTERNAVN OF KUNDE-02.
       MOVE "DK12345678912345" TO KONTONUMMER OF KUNDE-02.
       MOVE 7500.50 TO BALANCE OF KUNDE-02.
       MOVE "DKK" TO VALUTAKODE OF KUNDE-02.
       MOVE BALANCE OF KUNDE-02 TO BALANCE-DISPLAY OF KUNDE-02.
       DISPLAY "-----------------------------------"
       DISPLAY "Kunder"
       DISPLAY FORNAVN OF KUNDE-01 EFTERNAVN OF KUNDE-01
       DISPLAY BALANCE-DISPLAY OF KUNDE-01
       DISPLAY FORNAVN OF KUNDE-02 EFTERNAVN OF KUNDE-02
       DISPLAY BALANCE-DISPLAY OF KUNDE-02
       DISPLAY "-----------------------------------"
      * DISPLAY KUNDEOPLYSNINGER
       STOP RUN.
